Repository: altairos/MiLens-iOS
Catalog: MiLens/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: de, en, fr, ja, ko, zh_hant

# recap.monthCount %lld
source: %lld 张
de: %lld Erinnerungen
en: %lld memories
fr: %lld souvenirs
ja: %lldチャン
zh_hant: %lld 張

# recap.monthPhoto %@
source: %@ 的代表照片
de: %@-Highlights
en: %@ Highlights
fr: Moments forts de %@
ja: %@ の代表写真

# recap.renderFailed
source: 渲染失败
de: Lebensrückblick konnte nicht generiert werden
en: Couldn't generate your recap
fr: Impossible de générer la rétrospective
ja: レンダリングに失敗しました
zh_hant: 算繪失敗

# recap.title
source: 回忆册
de: Lebensrückblick
en: Year in Review
fr: Rétrospective de vie
ja: 思い出の本
zh_hant: 回憶冊

# recap.totalPhotos %lld
source: 共 %lld 张照片
de: Insgesamt %lld Fotos archiviert
en: %lld photos in total
fr: %lld photos archivées au total
ja: 合計 %lld枚の写真
zh_hant: 共 %lld 張照片

# recovery.body
source: 打开本地相册记录时出现问题。您可以重试，或重建本地数据：清除 MiLens 记录，同时也会删除沙盒中已保存的照片副本（导入/编辑产物）。系统相册中的原图不受影响。
de: Es gab ein Problem beim Öffnen lokaler Einträge. Du kannst es erneut versuchen oder die lokalen Daten neu aufbauen: Das löscht MiLens-Einträge und Sandbox-Fotokopien. Originale in deiner System-Mediathek bleiben unberührt.
en: There was a problem opening local records. You can retry, or rebuild local data: this clears MiLens records and sandbox photo copies. Originals in your system library are unaffected.
fr: Un problème est survenu lors de l'ouverture des données locales. Vous pouvez réessayer ou reconstruire la base : cela effacera les registres MiLens et les copies locales sans toucher à votre photothèque système.
ja: ローカルアルバムレコードを開く際に問題が発生しました。もう一度試すか、ローカルデータを再構築できます。MiLensレコードをクリアすると、サンドボックス （アーティファクトのインポート/編集） に保存されている写真のコピーも削除されます。「写真」アプリ内の元の画像には影響しません。
zh_hant: 開啟本機相簿記錄時發生問題。你可以重試或重建本機資料：這會清除 MiLens 記錄，也會刪除沙盒中儲存的照片副本（匯入／編輯作品）。系統相簿中的原圖不受影響。

# recovery.diagCreateFailed %@
source: 创建诊断目录失败：%@
de: Verzeichnis konnte nicht erstellt werden: %@
en: Couldn't create directory: %@
fr: Impossible de créer le dossier : %@
ja: 診断ディレクトリの作成に失敗しました：%@
zh_hant: 建立診斷目錄失敗：%@

# recovery.diagError %@
source: 错误：%@
de: Fehler: %@
en: Error: %@
fr: Erreur : %@
ja: 間違い：%@
zh_hant: 錯誤：%@

# recovery.diagHeader
source: MiLens 启动失败诊断
de: MiLens-Diagnoseprotokoll
en: MiLens Diagnostics Log
fr: Journal de diagnostic MiLens
ja: MiLens起動不良診断
zh_hant: MiLens 啟動失敗診斷

# recovery.diagTime %@
source: 时间：%@
de: Zeit: %@
en: Time: %@
fr: Date et heure : %@
ja: 時間：%@
zh_hant: 時間：%@

# recovery.diagWriteFailed %@
source: 写入诊断文件失败：%@
de: Protokolldatei konnte nicht geschrieben werden: %@
en: Couldn't write log file: %@
fr: Impossible d'écrire le fichier journal : %@
ja: 診断ファイルの書き込みに失敗しました：%@
zh_hant: 寫入診斷檔案失敗：%@

# recovery.diagnosticsExported
source: 诊断已导出
de: Diagnoseprotokoll exportiert
en: Diagnostics log exported
fr: Journal de diagnostic exporté
ja: エクスポートされた診断
zh_hant: 診斷已匯出

# recovery.exportDiagnostics
source: 导出诊断信息
de: Diagnose exportieren
en: Export Diagnostics
fr: Exporter le diagnostic
ja: 診断情報をエクスポートする
zh_hant: 匯出診斷資訊

# recovery.exportFailed
source: 导出失败
de: Diagnose-Export fehlgeschlagen
en: Diagnostics Export Failed
fr: Échec de l'exportation du diagnostic
ja: エクスポートに失敗しました
zh_hant: 匯出失敗

# recovery.rebuild
source: 重建
de: Neu aufbauen
en: Rebuild
fr: Reconstruire
ja: 復興

# recovery.rebuildConfirmBody
source: 将清除 MiLens 中的相册记录、伙伴档案及沙盒中已保存的照片副本（导入/编辑产物），且无法恢复。系统相册中的原图不会被删除。
de: Dadurch werden Albumeinträge, Haustierprofile und Sandbox-Fotokopien gelöscht. Diese Aktion kann nicht rückgängig gemacht werden. Originale bleiben in deiner Fotomediathek erhalten.
en: This will clear album records, pal profiles, and sandbox photo copies in MiLens. This action cannot be undone. Originals in your system photo library are unaffected.
fr: Cette action réinitialisera les albums, profils et copies locales dans MiLens. Cette opération est irréversible. Vos photos d'origine dans la photothèque restent intactes.
ja: MiLensのアルバムレコード、パートナーファイル、サンドボックス （製品のインポート/編集） に保存された写真のコピーは消去され、復元できなくなります。「写真」アプリ内の元の写真は削除されません。
zh_hant: 這會清除 MiLens 中的相簿記錄、毛小孩檔案，以及沙盒中儲存的照片副本（匯入／編輯作品），且無法復原。系統相簿中的原圖不會被刪除。

# recovery.rebuildConfirmTitle
source: 重建本地数据？
de: Lokale Datenbank neu aufbauen
en: Rebuild Local Database
fr: Reconstruire la base de données locale
ja: ローカルデータを再構築しますか？
zh_hant: 重建本機資料？

# recovery.rebuildData
source: 重建本地数据
de: Datenbank neu aufbauen
en: Rebuild Database
fr: Reconstruire la base
ja: ローカルデータを再構築する
zh_hant: 重建本機資料

# recovery.retry
source: 重试
de: Wiederholen
en: Retry
fr: Réessayer
ja: もう一度やり直してください
zh_hant: 重試

# recovery.title
source: 本地数据无法加载
de: Lokale Daten können nicht geladen werden
en: Can't Load Local Data
fr: Impossible de charger les données locales
ja: ローカルデータをロードできません
zh_hant: 本機資料無法載入

# redpacket.accessory.bow
source: 蝴蝶结
de: Schleife
en: Bow
fr: Nœud papillon
ja: ちょうネクタイ
zh_hant: 蝴蝶結

# redpacket.accessory.coin
source: 金币
de: Glücksmünze
en: Lucky Coin
fr: Pièce porte-bonheur
ja: 金
zh_hant: 金幣

# redpacket.accessory.firecracker
source: 鞭炮
de: Feuerwerkskörper
en: Firecrackers
fr: Pétards
ja: 爆竹

# redpacket.accessory.flower
source: 花卉
de: Blume
en: Flower
fr: Fleur
ja: 花

# redpacket.accessory.heart
source: 爱心
de: Warmes Herz
en: Warm Heart
fr: Cœur
ja: 愛
zh_hant: 愛心

# redpacket.accessory.lantern
source: 灯笼
de: Laterne
en: Lantern
fr: Lanterne rouge
ja: ランタン
zh_hant: 燈籠

# redpacket.accessory.paw
source: 爪印
de: Glückspfote
en: Lucky Paw
fr: Petite patte
ja: 足跡

# redpacket.accessory.star
source: 星星
de: Stern
en: Star
fr: Étoile
ja: 星

# redpacket.action.export
source: 导出封面
de: Cover exportieren
en: Export Cover
fr: Exporter la couverture
ja: 輸出カバー
zh_hant: 匯出封面

# redpacket.action.share
source: 分享
de: Teilen
en: Share
fr: Partager la couverture
ja: 共有

# redpacket.coverTitle
source: 封面标题
de: Cover-Titel
en: Cover Title
fr: Titre de la couverture
ja: 表紙タイトル
zh_hant: 封面標題

# redpacket.coverTitle.placeholder
source: 祝福语
de: Cover-Titel eingeben…
en: Enter cover title…
fr: Vœux personnalisés (ex. : Bonne Année !)
ja: 祝福
zh_hant: 祝福語

# redpacket.cutout.canEdit
source: 可继续编辑
de: Ausschnitt anpassen
en: Adjust Cutout
fr: Vous pourrez encore modifier le détourage
ja: 編集を続けることができます
zh_hant: 可繼續編輯

# redpacket.cutout.changePhoto
source: 换一张照片
de: Foto ändern
en: Change Photo
fr: Changer de photo
ja: 写真を変更する
zh_hant: 換一張照片

# redpacket.cutout.confirmTitle
source: 确认抠图
de: Ausschnitt bestätigen
en: Confirm Cutout
fr: Confirmation du détourage
ja: 切り抜きの確認
zh_hant: 確認去背

# redpacket.cutout.continue
source: 继续
de: Weiter
en: Continue
fr: Continuer
ja: 続く
zh_hant: 繼續

# redpacket.cutout.done
source: 抠图完成
de: Ausschnitt fertig
en: Cutout Done
fr: Détourage terminé
ja: 切り抜き完了
zh_hant: 去背完成

# redpacket.cutout.failed
source: 抠图失败，请重试或换一张照片
de: Freistellen fehlgeschlagen. Versuch es erneut oder wähle ein anderes Foto.
en: Cutout failed — try again or choose a different photo
fr: Échec du détourage. Réessayez ou choisissez une autre photo.
ja: 写真の切り抜きに失敗しました。もう一度試すか、写真を変更してください
zh_hant: 去背失敗，請重試或換一張照片

# redpacket.cutout.failedShort
source: 抠图失败
de: Ausschnitt fehlgeschlagen
en: Cutout Failed
fr: Échec du détourage
ja: 切り抜きに失敗しました
zh_hant: 去背失敗

# redpacket.cutout.loading
source: 加载中…
de: Wird geladen…
en: Loading…
fr: Chargement de la photo...
ja: 読み込み中…
zh_hant: 載入中…

# redpacket.cutout.nextStep
source: 下一步
de: Nächster Schritt
en: Next Step
fr: Étape suivante
ja: 次のステップ

# redpacket.cutout.processing
source: 正在抠图…
de: Haustier wird auf dem Gerät freigestellt…
en: Separating the subject on device…
fr: Détourage automatique en cours...
ja: 写真を切り抜いて…
zh_hant: 正在去背…

# redpacket.cutout.ready
source: 抠图完成，可以进入工作室编辑了
de: Freistellung fertig · Jetzt im Studio bearbeiten
en: Cutout ready — edit it in the workshop
fr: Le sujet est isolé et prêt à être utilisé.
ja: カットアウトが完成し、スタジオに入って編集できるようになります。
zh_hant: 去背完成，可以進入工作室編輯了

# redpacket.cutout.retry
source: 重试
de: Ausschnitt wiederholen
en: Retry Cutout
fr: Réessayer le détourage
ja: もう一度やり直してください
zh_hant: 重試

# redpacket.cutout.status
source: 抠图状态
de: Ausschnitt-Status
en: Cutout Status
fr: État du détourage
ja: 切り抜き状態
zh_hant: 去背狀態

# redpacket.cutout.subjectSeparated
source: 主体已分离
de: Haustier vom Hintergrund freigestellt
en: Subject separated from background
fr: Sujet séparé de l'arrière-plan
ja: 主題が分離されました
zh_hant: 主體已分離

# redpacket.cutout.tool.changePhoto
source: 换图
de: Foto ändern
en: Change Photo
fr: Changer de photo
ja: 画像を変更する
zh_hant: 換圖

# redpacket.cutout.tool.cutout
source: 抠图
de: Ausschnitt
en: Cutout
fr: Détourage
ja: 切り取る
zh_hant: 去背

# redpacket.cutout.tool.retry
source: 重试
de: Wiederholen
en: Retry
fr: Réessayer
ja: もう一度やり直してください
zh_hant: 重試

# redpacket.export.chatPreview
source: 场景预览
de: Sprechblasen-Vorschau
en: Chat Bubble Preview
fr: Aperçu en discussion
ja: シーンのプレビュー
zh_hant: 場景預覽

# redpacket.export.defaultSender
source: 家人
de: Familie
en: Little One's Family
fr: La famille
ja: 家族

# redpacket.export.defaultTitle
source: 恭喜发财
de: Frohes Neues Jahr
en: Happy New Year
fr: Bonne année
ja: あなたが幸せで豊かになりますように
zh_hant: 恭喜發財

# redpacket.export.discard
source: 放弃
de: Verwerfen
en: Discard
fr: Ignorer
ja: あきらめる
zh_hant: 放棄

# redpacket.export.editorialTitle
source: 从聊天到打开， 看看完整效果。
de: Vom Chat bis zum Öffnen, sieh dir den vollen Effekt an.
en: From chat to the reveal, see the full effect.
fr: Du chat à l'ouverture, découvrez le rendu complet.
ja: 雑談からオープニングまで、 効果の全体像をご覧ください。
zh_hant: 從聊天到打開， 看看完整效果。

# redpacket.export.exceeded
source: 超出限制
de: Dateigröße überschreitet Limit von 500 KB
en: File size exceeds 500 KB limit
fr: Dépassement de la taille maximale
ja: 限界を超える

# redpacket.export.fail.fileSize
source: 文件超过限制，最大
de: Dateigröße überschreitet Limit von 500 KB
en: File size exceeds 500 KB limit
fr: Taille de fichier trop grande (max. 500 Ko)
ja: ファイルが制限、最大値を超えています
zh_hant: 檔案超過限制，最大

# redpacket.export.fail.format
source: 格式不受支持
de: Muss im PNG- oder JPG-Format sein
en: Must be PNG or JPG format
fr: Format non pris en charge
ja: サポートされていない形式
zh_hant: 格式不受支援

# redpacket.export.fail.size
source: 尺寸不符合平台要求
de: Die Auflösung muss exakt 957 × 1278 betragen
en: Resolution must be exactly 957 × 1278
fr: Dimensions incorrectes (957 × 1278 px requis)
ja: サイズがプラットフォームの要件を満たしていません

# redpacket.export.fileSize
source: 文件大小
de: Dateigröße: < 500 KB
en: File Size: < 500 KB
fr: Taille du fichier
ja: ファイルサイズ
zh_hant: 檔案大小

# redpacket.export.format
source: 格式
de: Format: PNG (< 500 KB)
en: Format: PNG (< 500 KB)
fr: Format d'exportation
ja: 形式

# redpacket.export.hasWatermark
source: 免费版导出含 MiLens 水印
de: Mit Wasserzeichen (Kostenlos)
en: Watermarked (Free)
fr: Avec filigrane
ja: MiLensウォーターマーク付きの無料バージョンのエクスポート
zh_hant: 免費版匯出含 MiLens 浮水印

# redpacket.export.howToUse
source: 保存到相册后，在微信红包封面页面选择自定义封面即可
de: In „Fotos“ sichern und in WeChat als eigenes Red-Packet-Cover auswählen
en: Save to Photos, then choose it as a custom cover on WeChat's Red Packet page
fr: Enregistrez dans Photos, puis choisissez l'image comme couverture personnalisée sur WeChat.
ja: アルバムに保存した後、WeChatの赤い封筒の表紙ページでカスタマイズされた表紙を選択します。
zh_hant: 儲存到相簿後，在微信紅包封面頁面選擇自訂封面即可

# redpacket.export.loadFailed
source: 加载草稿失败
de: Entwurf konnte nicht geladen werden
en: Couldn't load your draft
fr: Impossible de charger l'aperçu
ja: ドラフトのロードに失敗しました
zh_hant: 載入草稿失敗

# redpacket.export.noWatermark
source: 无水印导出（Pro）
de: Kein Wasserzeichen (Pro)
en: No Watermark (Pro)
fr: Sans filigrane (Pro)
ja: ウォーターマークなしでエクスポート （Pro）
zh_hant: 無浮水印匯出（Pro）

# redpacket.export.openButton
source: 開
de: Sicherer Bereich für WeChat-Öffnen-Button
en: Open Button Safe Zone
fr: Bouton d'ouverture
ja: 開ける

# redpacket.export.passed
source: 符合规格
de: Alle Spezifikationen verifiziert
en: All specifications verified
fr: Conforme aux spécifications WeChat
ja: 仕様を満たしています
zh_hant: 符合規格

# redpacket.export.previewNote
source: 以上为示意效果，实际显示以微信为准
de: Nur Vorschau; die tatsächliche Anzeige wird von WeChat gesteuert
en: Preview only; actual display is controlled by WeChat
fr: L'aperçu simule l'affichage réel dans WeChat.
ja: 上記は概略的な効果であり、実際の表示はWeChatの影響を受けます。
zh_hant: 以上為示意效果，實際顯示以微信為準

# redpacket.export.proHint
source: 升级 Pro 后导出无水印
de: Auf Pro upgraden für Cover ohne Wasserzeichen
en: Upgrade to Pro for watermark-free covers
fr: Passez à MiLens Pro pour exporter sans filigrane
ja: Proにアップグレードした後、ウォーターマークなしでエクスポートする
zh_hant: 升級 Pro 後匯出無浮水印

# redpacket.export.productCheck
source: 成品检查
de: Spezifikations-Check
en: Specifications Check
fr: Vérification des spécifications
ja: 完成品検査
zh_hant: 成品檢查

# redpacket.export.saveFailed
source: 保存到相册失败，请检查相册权限
de: Konnte nicht in „Fotos“ gespeichert werden. Prüfe den Fotozugriff und versuche es erneut.
en: Couldn't save to Photos — check Photos permission and try again
fr: Impossible d'enregistrer dans Photos. Vérifiez l'autorisation et réessayez.
ja: アルバムに保存できませんでした。アルバムの権限を確認してください
zh_hant: 儲存到相簿失敗，請檢查相簿權限

# redpacket.export.saveOrShare
source: 保存或分享
de: In Fotos speichern oder teilen
en: Save to Photos or Share
fr: Enregistrer ou Partager
ja: 保存または共有
zh_hant: 儲存或分享

# redpacket.export.saved
source: 已保存到相册
de: In Fotos gespeichert
en: Saved to Photos
fr: Enregistré avec succès
ja: アルバムに保存されました
zh_hant: 已儲存到相簿

# redpacket.export.scene.banner
source: 聊天横幅
de: Banner-Ansicht
en: Banner View
fr: Bannière
ja: チャットバナー
zh_hant: 聊天橫幅

# redpacket.export.scene.card
source: 红包卡片
de: Cover-Karte
en: Cover Card
fr: Carte de discussion
ja: 赤い封筒カード
zh_hant: 紅包卡片

# redpacket.export.scene.list
source: 红包列表
de: Listen-Ansicht
en: List View
fr: Liste des messages
ja: 赤い封筒のリスト
zh_hant: 紅包列表

# redpacket.export.scene.open
source: 拆红包页
de: Umschlag-Ansicht
en: Envelope View
fr: Écran d'ouverture
ja: 赤い封筒のページを開く
zh_hant: 拆紅包頁

# redpacket.export.sceneLabel
source: 场景预览
de: Szene
en: Scene
fr: Scène
ja: シーンのプレビュー
zh_hant: 場景預覽

# redpacket.export.sceneOverline
source: SCENE PREVIEW
de: Szenen-Vorschau
fr: APERÇU DE LA SCÈNE
ja: シーンプレビュー

# redpacket.export.scenePreview
source: 场景预览
de: WeChat-Szenen-Simulation
en: WeChat Scene Simulation
fr: Aperçu de la scène
ja: シーンのプレビュー
zh_hant: 場景預覽

# redpacket.export.shareFailed
source: 分享准备失败，请重试
de: Teilen konnte nicht vorbereitet werden. Versuch es erneut.
en: Couldn't prepare sharing — please try again
fr: Impossible de préparer le partage. Réessayez.
ja: 共有の準備に失敗しました。もう一度お試しください。
zh_hant: 分享準備失敗，請重試

# redpacket.export.shareReady
source: 已准备分享，选择目标应用即可
de: Bereit zum Teilen · Wähle eine App aus
en: Ready to share — choose an app to continue
fr: Prêt à partager · Choisissez une app
ja: 共有する準備ができました。対象のアプリを選択するだけです
zh_hant: 已準備分享，選擇目標應用程式即可

# redpacket.export.shareTitle
source: 分享预览
de: Red-Packet-Cover teilen
en: Share WeChat Cover
fr: Partager la couverture
ja: プレビューを共有する
zh_hant: 分享預覽

# redpacket.export.size
source: 尺寸
de: 957 × 1278 px
en: 957 × 1278 px
fr: Dimensions de l'image
ja: サイズ

# redpacket.export.status
source: 状态
de: Export-Status
en: Export Status
fr: État de l'exportation
ja: 州
zh_hant: 狀態

# redpacket.export.step.openCover
source: 打开红包封面
de: 1. Öffne die WeChat-Plattform für Red-Packet-Cover
en: 1. Open WeChat Cover Platform
fr: Ouvrez la page des couvertures sur WeChat
ja: 赤い封筒のカバーを開けて
zh_hant: 打開紅包封面

# redpacket.export.step.saveImage
source: 保存图片
de: 2. Speichere das Bild
en: 2. Save the Image
fr: Enregistrez l'image
ja: 画像を保存
zh_hant: 儲存圖片

# redpacket.export.step.selectCustom
source: 选自定义封面
de: 3. Wähle benutzerdefiniertes Cover
en: 3. Choose Custom Cover
fr: Choisissez une couverture personnalisée
ja: カスタムカバーを選択してください
zh_hant: 選自訂封面

# redpacket.export.title
source: 导出预览
de: Red-Packet-Cover exportieren
en: Export WeChat Cover
fr: Exporter la couverture d'enveloppe
ja: プレビューのエクスポート
zh_hant: 匯出預覽

# redpacket.optimize.after
source: 优化后
de: Nach der Optimierung
en: After Optimization
fr: Après optimisation
ja: 最適化後
zh_hant: 最佳化後

# redpacket.optimize.applied
source: 已为你调整
de: Optimierungen angewendet
en: Optimizations applied
fr: Optimisation appliquée
ja: すでにあなたのために調整されています
zh_hant: 已為你調整

# redpacket.optimize.before
source: 优化前
de: Vor der Optimierung
en: Before Optimization
fr: Avant optimisation
ja: 最適化前
zh_hant: 最佳化前

# redpacket.optimize.button
source: 智能优化
de: Layout automatisch optimieren
en: Auto-Optimize Layout
fr: Optimisation intelligente
ja: インテリジェントな最適化
zh_hant: 智慧最佳化

# redpacket.optimize.disclaimer
source: 智能优化不会承诺平台审核通过
de: Die automatische Optimierung ist keine Garantie dafür, dass die Plattform das Cover genehmigt.
en: Auto-optimization is not a promise that the platform will approve the cover.
fr: L'optimisation intelligente ne garantit pas l'approbation par la plateforme
ja: インテリジェントな最適化はプラットフォームのレビューに合格することを約束するものではありません
zh_hant: 智慧最佳化不保證平台審核一定通過

# redpacket.optimize.noSourceChange
source: 未更换原图，也未重新抠图
de: Originalfoto bleibt unberührt
en: Original photo remains untouched
fr: La photo d'origine n'est pas modifiée.
ja: 元の画像は置き換えられたり、再カットされたりしていません。
zh_hant: 未更換原圖，亦未重新去背

# redpacket.optimize.suggestTitle
source: 建议优化
de: Layout-Empfehlungen
en: Layout Recommendations
fr: Suggestions d'optimisation
ja: 推奨される最適化
zh_hant: 建議最佳化

# redpacket.optimize.summary.noChanges
source: 当前画面无需调整
de: Das Layout entspricht bereits den WeChat-Richtlinien für den sicheren Bereich
en: Layout already meets WeChat safe zone guidelines
fr: Aucun ajustement nécessaire, la mise en page est déjà optimale.
ja: 現在の画面を調整する必要はありません
zh_hant: 目前畫面無需調整

# redpacket.optimize.summary.petPos
source: 伙伴主体移入安全区
de: Haustier im oberen mittleren Sicherheitsbereich platziert
en: Subject moved to the upper-middle safe area
fr: Recadrage et centrage du sujet
ja: パートナー被写体が安全地帯に移動する
zh_hant: 毛小孩移入安全區

# redpacket.optimize.summary.textPos
source: 文字移入安全区
de: Glückwunsch-Text wurde aus dem Bereich des WeChat-Öffnen-Buttons verschoben
en: Blessing text moved clear of the WeChat open button
fr: Repositionnement des textes dans la zone lisible
ja: テキストを安全な領域に移動する
zh_hant: 文字移入安全區

# redpacket.optimize.undoThis
source: 撤销本次调整
de: Layout-Optimierung rückgängig machen
en: Undo Layout Optimization
fr: Annuler l'optimisation
ja: この調整をキャンセルします
zh_hant: 復原本次調整

# redpacket.overline
source: WECHAT RED ENVELOPES
de: Red-Packet-Cover
fr: ENVELOPPES ROUGES WECHAT
ja: Wechatの赤い封筒

# redpacket.quality.allGood
source: 全部通过
de: Alle Qualitätsprüfungen bestanden
en: All quality checks passed
fr: Tous les contrôles sont au vert
ja: 全員合格
zh_hant: 全部通過

# redpacket.quality.badge.error
source: 问题
de: Überprüfung erforderlich
en: Review Needed
fr: Non conforme
ja: 質問
zh_hant: 問題

# redpacket.quality.badge.warning
source: 建议
de: Warnung
en: Warning
fr: Suggestion
ja: 提案
zh_hant: 建議

# redpacket.quality.brightness.bright.detail
source: 照片偏亮（亮度 %lld%%），可能过曝
de: Das Foto wirkt hell (Helligkeit %lld%%) und könnte überbelichtet sein
en: Photo looks bright (brightness %lld%%) and may be overexposed
fr: La photo paraît claire (luminosité %lld%%) et risque d'être surexposée
ja: 写真が明るすぎる （明るさ %lld%%） ため、露出オーバーの可能性があります
zh_hant: 照片偏亮（亮度 %lld%%），可能過曝

# redpacket.quality.brightness.dark.detail
source: 照片偏暗（亮度 %lld%%），建议提亮
de: Das Foto wirkt dunkel (Helligkeit %lld%%) · Helle es etwas auf
en: Photo looks dark (brightness %lld%%) — consider brightening it
fr: La photo paraît sombre (luminosité %lld%%) · Éclaircissez-la légèrement
ja: 写真が暗い （明るさ %lld%%）、明るくすることをお勧めします
zh_hant: 照片偏暗（亮度 %lld%%），建議提亮

# redpacket.quality.brightness.highlightClipping.detail
source: 高光细节较少（高光剪切 %lld%%），建议降低曝光
de: In den Lichtern fehlen Details (%lld%%) · Verringere die Belichtung
en: Highlights are clipped (%lld%%) — consider lowering exposure
fr: Des détails sont perdus dans les hautes lumières (%lld%%) · Baissez l'exposition
ja: ハイライトの詳細が少ないため （ハイライトのクリッピング %lld%%）、露出を下げることをお勧めします。
zh_hant: 高光細節較少（高光剪切 %lld%%），建議降低曝光

# redpacket.quality.brightness.pass.detail
source: 亮度适中
de: Helligkeit und Belichtung sind gut ausbalanciert
en: Brightness and exposure are well balanced
fr: La luminosité globale est bien équilibrée
ja: 適度な明るさ
zh_hant: 亮度適中

# redpacket.quality.brightness.shadowClipping.detail
source: 暗部细节较少（阴影剪切 %lld%%），建议适度提亮
de: In den Schatten fehlen Details (%lld%%) · Helle sie etwas auf
en: Shadow detail is lost (%lld%%) — consider lifting shadows slightly
fr: Des détails sont perdus dans les ombres (%lld%%) · Éclaircissez-les légèrement
ja: 暗い領域のディテールが少ないため （影のクリッピング %lld%%）、適切に明るくすることをお勧めします。
zh_hant: 暗部細節較少（陰影剪切 %lld%%），建議適度提亮

# redpacket.quality.brightness.unavailable.detail
source: 无法读取原图像素，尚未完成亮度检查
de: Beleuchtung kann nicht bewertet werden
en: Unable to evaluate lighting
fr: Données de luminosité indisponibles
ja: 元の画像のピクセルを読み取ることができません。明るさのチェ​​ックがまだ完了していません
zh_hant: 無法讀取原圖像素，尚未完成亮度檢查

# redpacket.quality.clarity.blur.detail
source: 清晰度偏低（Laplacian 方差 %lld），照片可能模糊
de: Die Schärfe ist niedrig (%lld) · Das Foto könnte unscharf wirken
en: Sharpness score is low (%lld) — the photo may look blurry
fr: L'image est floue (%lld) — veuillez utiliser une photo plus nette
ja: シャープネスが低い （ラプラシアン分散 %lld）、写真がぼやける可能性があります

# redpacket.quality.clarity.pass.detail
source: 清晰度良好
de: Die Schärfe ist gut
en: Sharpness is good
fr: La netteté est conforme aux exigences
ja: 良好な透明度

# redpacket.quality.clarity.resolution.detail
source: 原图分辨率 %1$lld×%2$lld（%3$lld 像素），建议使用更高清的照片
de: Originalauflösung: %1$lld × %2$lld (%3$lld Pixel); ein hochauflösenderes Foto wird empfohlen
en: Original resolution: %1$lld × %2$lld (%3$lld pixels); a higher-resolution photo is recommended
fr: Résolution d'origine : %1$lld × %2$lld (%3$lld pixels) — une photo de meilleure résolution est recommandée
ja: 元の画像の解像度 %1$lld×%2$lld（%3$lldピクセル）、高解像度の写真を使用することをお勧めします
zh_hant: 原圖解析度 %1$lld×%2$lld（%3$lld 像素），建議使用更高畫質的照片

# redpacket.quality.clarity.soft.detail
source: 清晰度一般（%lld），建议更换更清晰的照片
de: Die Bildschärfe ist etwas gering (%lld) — ein klareres Foto wird empfohlen
en: Image sharpness is slightly low (%lld) — recommend a clearer photo
fr: Netteté légèrement faible (%lld) — photo plus nette recommandée
ja: 透明度は平均的 （%lld） です。より鮮明な写真に置き換えることをお勧めします。
zh_hant: 清晰度一般（%lld），建議更換更清晰的照片

# redpacket.quality.clarity.unavailable.detail
source: 无法读取原图像素，尚未完成清晰度检查
de: Bildklarheit kann nicht bewertet werden
en: Unable to assess image clarity
fr: Données de netteté indisponibles
ja: 元の画像のピクセルを読み取ることができません。鮮明度チェックがまだ完了していません
zh_hant: 無法讀取原圖像素，尚未完成清晰度檢查

# redpacket.quality.completed
source: 已完成
de: Qualitätsprüfung abgeschlossen
en: Quality check completed
fr: Contrôle qualité terminé
ja: 完了

# redpacket.quality.composition.clipped.detail
source: 伙伴主体有 %lld%% 超出画布，可能被裁切
de: %lld%% des Motivs liegen außerhalb der Fläche · Passe den Ausschnitt an
en: Subject is clipped near the edges (%lld%%) — adjust the crop
fr: %lld%% du sujet dépasse de la zone · Ajustez le recadrage
ja: パートナーのボディは %lld%% キャンバスを超えているため、切り取られる可能性があります
zh_hant: 毛小孩主體有 %lld%% 超出畫布，可能被裁切

# redpacket.quality.composition.pass.detail
source: 构图良好
de: Das Motiv ist gut im sicheren WeChat-Bereich zentriert
en: Subject is well centered within the WeChat safe area
fr: La composition respecte la zone visible
ja: よく構成されている
zh_hant: 構圖良好

# redpacket.quality.composition.safezone.detail
source: 伙伴主体仅有 %lld%% 位于安全区，红包控件可能遮挡主体
de: Nur %lld%% des Motivs befinden sich im sicheren Bereich; WeChat-Steuerelemente könnten es verdecken
en: Only %lld%% of the subject is in the safe area; WeChat controls may cover it
fr: Seuls %lld%% du sujet se trouvent dans la zone de sécurité ; les commandes WeChat risquent de le masquer
ja: パートナーの被写体の%lld%%しか安全領域内になく、紅包のUIが被写体を隠す可能性があります
zh_hant: 毛小孩主體僅有 %lld%% 位於安全區，紅包元件可能遮擋主體

# redpacket.quality.composition.small.detail
source: 伙伴主体占比偏小（%lld%%），建议放大或移动
de: Das Motiv nimmt nur %lld%% der Fläche ein — zoome heran
en: Subject occupies only %lld%% of area — zoom in
fr: Le sujet n'occupe que %lld%% de la surface — zoomez
ja: パートナーの被写体が小さすぎます（%lld%%）。拡大または移動をおすすめします。
zh_hant: 毛小孩主體佔比偏小（%lld%%），建議放大或移動
